
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 12 to add, 0 to change, 3 to destroy.</code></pre>

* Create
  * azurerm_storage_blob.b2c_favicon_svg
  * azurerm_storage_blob.b2c_font_bold_v2_2_woff2
  * azurerm_storage_blob.b2c_font_bold_v2_woff
  * azurerm_storage_blob.b2c_font_light_v2_2_woff2
  * azurerm_storage_blob.b2c_font_light_v2_woff
  * azurerm_storage_blob.b2c_govuk_crest_2x_png
  * azurerm_storage_blob.b2c_govuk_crest_png
  * azurerm_storage_blob.b2c_govuk_icon_180_png
  * azurerm_storage_blob.b2c_icon_mask_svg
  * azurerm_storage_blob.b2c_main_css
* Delete
  * azurerm_storage_blob.b2c_login_css
* Replace
  * azurerm_storage_blob.b2c_favicon
  * azurerm_storage_blob.b2c_login_html


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_storage_blob.b2c_favicon must be replaced
-/+ resource "azurerm_storage_blob" "b2c_favicon" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_md5            = "de7abc5226925203ac10b0a4a94af949" -> "a90776c99cc9bf3d9dbe593284d6bbf6" # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/favicon.ico" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "favicon.ico"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/favicon.ico" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_favicon_svg will be created
  + resource "azurerm_storage_blob" "b2c_favicon_svg" {
      + access_tier            = (known after apply)
      + content_md5            = "e1321ba525137ed156ed48e69369531c"
      + content_type           = "image/svg+xml"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "favicon.svg"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/favicon.svg"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_font_bold_v2_2_woff2 will be created
  + resource "azurerm_storage_blob" "b2c_font_bold_v2_2_woff2" {
      + access_tier            = (known after apply)
      + content_md5            = "b542beb2746ca0e4a5a9aa7ea7767df7"
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "bold-b542beb274-v2.woff2"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/bold-b542beb274-v2.woff2"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_font_bold_v2_woff will be created
  + resource "azurerm_storage_blob" "b2c_font_bold_v2_woff" {
      + access_tier            = (known after apply)
      + content_md5            = "affa96571d94a9ab7d95b0850b26edde"
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "bold-affa96571d-v2.woff"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/bold-affa96571d-v2.woff"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_font_light_v2_2_woff2 will be created
  + resource "azurerm_storage_blob" "b2c_font_light_v2_2_woff2" {
      + access_tier            = (known after apply)
      + content_md5            = "94a07e06a104e76fe40583f74b204aee"
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "light-94a07e06a1-v2.woff2"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/light-94a07e06a1-v2.woff2"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_font_light_v2_woff will be created
  + resource "azurerm_storage_blob" "b2c_font_light_v2_woff" {
      + access_tier            = (known after apply)
      + content_md5            = "f591b13f7daad512cf0dfa0ddcb2960e"
      + content_type           = "application/octet-stream"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "light-f591b13f7d-v2.woff"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/light-f591b13f7d-v2.woff"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_govuk_crest_2x_png will be created
  + resource "azurerm_storage_blob" "b2c_govuk_crest_2x_png" {
      + access_tier            = (known after apply)
      + content_md5            = "57a05afc1fc634420a02ff0151675de0"
      + content_type           = "image/x-png"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "govuk-crest-2x.png"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/govuk-crest-2x.png"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_govuk_crest_png will be created
  + resource "azurerm_storage_blob" "b2c_govuk_crest_png" {
      + access_tier            = (known after apply)
      + content_md5            = "bcd5768bd7721641ee71ba103bb38900"
      + content_type           = "image/x-png"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "govuk-crest.png"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/govuk-crest.png"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_govuk_icon_180_png will be created
  + resource "azurerm_storage_blob" "b2c_govuk_icon_180_png" {
      + access_tier            = (known after apply)
      + content_md5            = "ae577696a9d0466ee2019f46ec4c684f"
      + content_type           = "image/x-png"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "govuk-icon-180.png"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/govuk-icon-180.png"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_icon_mask_svg will be created
  + resource "azurerm_storage_blob" "b2c_icon_mask_svg" {
      + access_tier            = (known after apply)
      + content_md5            = "ff75b23964656ce28eece43f266d9f1d"
      + content_type           = "image/svg+xml"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "govuk-icon-mask.svg"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/govuk-icon-mask.svg"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_login_css will be destroyed
  # (because azurerm_storage_blob.b2c_login_css is not in configuration)
  - resource "azurerm_storage_blob" "b2c_login_css" {
      - access_tier            = "Hot" -> null
      - content_md5            = "98f1677b55b392d7b5b308461ca70d82" -> null
      - content_type           = "text/css" -> null
      - id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/login.css" -> null
      - metadata               = {} -> null
      - name                   = "login.css" -> null
      - parallelism            = 8 -> null
      - size                   = 0 -> null
      - source                 = "./b2c/login.css" -> null
      - storage_account_name   = "presastg" -> null
      - storage_container_name = "pre-b2c-container" -> null
      - type                   = "Block" -> null
      - url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/login.css" -> null
    }

  # azurerm_storage_blob.b2c_login_html must be replaced
-/+ resource "azurerm_storage_blob" "b2c_login_html" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_md5            = "86c2c010d227f9fd6bf3a38b7ec82f09" -> "97d7f655444ded5cb86b0bddfda76afa" # forces replacement
      ~ id                     = "https://presastg.blob.core.windows.net/pre-b2c-container/login.html" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "login.html"
      ~ url                    = "https://presastg.blob.core.windows.net/pre-b2c-container/login.html" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_main_css will be created
  + resource "azurerm_storage_blob" "b2c_main_css" {
      + access_tier            = (known after apply)
      + content_md5            = "2c32693834e83a99f4cb0ff2a39d207f"
      + content_type           = "text/css"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "main.css"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/main.css"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

Plan: 12 to add, 0 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":728,"Program":"tfcmt","SHA1":"","Vars":{}} -->